<script lang="ts" setup>
import Topic from '@/pages/user/components/topic.vue'
import EventBus from '@/eventBus'

const getNewQuetions = () => {
  EventBus.emit('getNewQuestionListPage')
}

const getHotQuetions = () => {
  EventBus.emit('getHotQuestionListPage')
}
</script>

<template>
  <!-- 问答社区左边栏内容 -->
  <div class="select-none bg-white rounded-sm shadow-sm mb-3">
    <!-- 顶部区域 -->
    <div class="p-2">
      <div
        @click="getNewQuetions"
        class="hover:text-[#1A56DB] hover:bg-[#F7F8FA] flex gap-1 items-center justify-center cursor-pointer h-[50px]"
      >
        <svg
          t="1712684867797"
          class="icon"
          viewBox="0 0 1170 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="18258"
          width="20"
          height="20"
        >
          <path
            d="M539.546537 289.0275c-10.030841 5.788562-16.337116 16.54283-16.337116 28.121096V544.457935c0 12.094837 14.991975 22.225106 24.71196 27.70624 2.689138 4.029708 10.132555 7.751987 14.684547 10.33484l134.21235 81.247866c15.508546 8.892557 32.363375 3.723422 41.462788-11.884552 8.788557-15.505117 0.516571-35.458227-15.094832-44.449069l-135.039777-77.841015V317.148596c0-11.578267-6.205704-22.331392-16.235402-28.121096-9.927984-5.891419-22.332535-5.891419-32.364518 0M585.767032 122.288347C689.267433 121.982061 788.741554 163.019708 861.844291 236.309873c152.205463 152.056892 152.205463 399.322769 0 551.279089-73.619307 73.599878-171.748288 114.122097-276.077259 114.122097-103.503829 0.413714-202.974522-40.72679-275.973258-114.12324C236.068181 713.990226 195.430534 616.200674 195.430534 512.001989 195.121963 408.629588 236.273895 309.288038 309.793774 236.412729 382.895368 163.018565 482.262061 121.982061 585.767032 122.287204"
            fill="currentColor"
            p-id="18259"
          ></path>
        </svg>
        <span>最新</span>
      </div>
      <div
        @click="getHotQuetions"
        class="hover:text-[#1A56DB] hover:bg-[#F7F8FA] flex gap-1 items-center justify-center cursor-pointer h-[50px]"
      >
        <svg
          t="1712685995290"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="25226"
          width="20"
          height="20"
        >
          <path
            d="M256 461.44C409.429333 333.056 492.16 234.666667 385.493333 85.333333c318.506667 85.333333 374.613333 341.333333 339.84 376.106667-42.666667 42.666667-57.173333 142.805333 21.333334 157.226667 78.506667 14.421333 106.666667-64 121.045333-178.858667C1002.666667 725.333333 810.666667 938.666667 558.250667 981.333333c-87.936-103.978667-121.130667-271.872-131.584-320-20.906667 52.949333-106.666667 170.666667-41.173334 298.666667C170.666667 896 42.666667 640 256 461.44z"
            fill="currentColor"
            p-id="25227"
          ></path>
        </svg>
        <span>沸点</span>
      </div>
    </div>
  </div>
  <!-- 底部区域 -->
  <Topic></Topic>
</template>

<style scoped></style>
