<script setup>
import { getTalkRank } from '@/api/user/ask'
import { onMounted, ref } from 'vue'
import EventBus from '@/eventBus'

const talkRankData = ref()

onMounted(() => {
  getTalkRank().then((res) => {
    if (res.success) {
      console.log(res.data)
      talkRankData.value = res.data
    }
  })
})

const getTalkList = (talkId) => {
  EventBus.emit('getTalkQuestionListPage', talkId)
}
</script>

<template>
  <div class="bg-white shadow-sm rounded-sm select-none">
    <!-- 头部区域 -->
    <div class="flex items-center p-2 gap-1 text-sm border-b">
      <svg
        t="1712686426033"
        class=""
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="37640"
        width="18"
        height="18"
      >
        <path
          d="M506.88 960.853333c-59.733333 0-117.76-11.946667-172.373333-34.133333-25.6-10.24-51.2-23.893333-73.386667-39.253333-8.533333 0-37.546667 5.12-129.706667 29.013333-8.533333 1.706667-18.773333 0-25.6-6.826667s-8.533333-15.36-6.826666-25.6c25.6-92.16 29.013333-121.173333 29.013333-129.706666-15.36-23.893333-29.013333-47.786667-39.253333-73.386667-22.186667-54.613333-34.133333-112.64-34.133334-172.373333 0-249.173333 203.093333-452.266667 452.266667-452.266667s452.266667 203.093333 452.266667 452.266667-201.386667 452.266667-452.266667 452.266666zM264.533333 836.266667c11.946667 0 17.066667 3.413333 20.48 5.12 22.186667 15.36 44.373333 27.306667 69.973334 37.546666 49.493333 20.48 100.693333 30.72 153.6 30.72 221.866667 0 401.066667-179.2 401.066666-401.066666S728.746667 107.52 506.88 107.52 105.813333 288.426667 105.813333 508.586667c0 52.906667 10.24 104.106667 30.72 153.6 10.24 23.893333 22.186667 47.786667 37.546667 69.973333 6.826667 10.24 13.653333 18.773333-13.653333 124.586667 59.733333-15.36 88.746667-20.48 104.106666-20.48z m-133.12-75.093334z"
          fill="#656866"
          p-id="37641"
        ></path>
        <path
          d="M708.266667 445.44h-358.4c-13.653333 0-25.6-11.946667-25.6-25.6s11.946667-25.6 25.6-25.6h358.4c13.653333 0 25.6 11.946667 25.6 25.6s-11.946667 25.6-25.6 25.6z"
          fill="#656866"
          p-id="37642"
        ></path>
        <path
          d="M399.36 711.68h-5.12c-13.653333-1.706667-23.893333-15.36-20.48-29.013333l61.44-353.28c1.706667-13.653333 15.36-23.893333 29.013333-20.48 13.653333 1.706667 23.893333 15.36 20.48 29.013333l-61.44 353.28c0 11.946667-11.946667 20.48-23.893333 20.48zM549.546667 711.68h-5.12c-13.653333-1.706667-23.893333-15.36-20.48-29.013333l61.44-353.28c1.706667-13.653333 15.36-23.893333 29.013333-20.48 13.653333 1.706667 23.893333 15.36 20.48 29.013333l-61.44 353.28c-1.706667 11.946667-11.946667 20.48-23.893333 20.48z"
          fill="#656866"
          p-id="37643"
        ></path>
        <path
          d="M665.6 619.52H307.2c-13.653333 0-25.6-11.946667-25.6-25.6s11.946667-25.6 25.6-25.6h358.4c13.653333 0 25.6 11.946667 25.6 25.6s-11.946667 25.6-25.6 25.6z"
          fill="#656866"
          p-id="37644"
        ></path>
        <path
          d="M423.253333 513.706667m-131.413333 0a131.413333 131.413333 0 1 0 262.826667 0 131.413333 131.413333 0 1 0-262.826667 0Z"
          fill="#656866"
          opacity=".3"
          p-id="37645"
        ></path>
      </svg>
      <span>热门话题</span>
    </div>
    <div class="text-center p-2">
      <div
        v-for="talk in talkRankData"
        :key="talk.id"
        @click="getTalkList(talk.id)"
        class="p-2 text-sm hover:bg-[#F7F8FA] cursor-pointer rounded-sm hover:text-[#1A56DB]"
      >
        #&nbsp;{{ talk.name }}
      </div>
    </div>
  </div>
</template>

<style scoped>
:deep(.el-sub-menu__title) {
  display: flex;
  justify-content: center;
  gap: 2px;
}
:deep(.el-sub-menu__title:hover) {
  background-color: #f7f8fa;
}
:deep(.el-menu-item-group__title) {
  display: none;
}
:deep(.el-menu-item:hover) {
  background-color: #f7f8fa;
}
:deep(.el-menu-item) {
  display: flex;
  justify-content: center;
  padding-right: 44px;
}
:deep(.el-menu-item.is-active) {
  color: #1a56db;
}
</style>
